docker/app/models/user.rb

  def assign_default_role
    add_role(:user) if roles.blank?
    add_role(:admin) if Rails.application.config.authorized_for_admin_role.include?(username)
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]
SELECT 1 AS one FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "user"], ["LIMIT", 1]]